{
  "propos": "About",
  "comp": "Skills",
  "proj": "Projects",
  "form": "Education",
  "exp": "Experience",
  "cont": "Contact",
  "hero-title": "Portfolio",
  "hero-name": "Giorgio UTZERI",
  "hero-description": "Student in IT (BUT Informatique)",
  "apropos-h1": "About Me",
  "apropos-p": "🙍‍♂️ Introduction:<br>My name is Giorgio Utzeri, I am 19 years old, and I am passionate about programming. I explore various programming languages and working methods to improve my skills every day.<br><br>📖 Studies:<br>I am currently in the second year of a BUT Informatique degree at the University of Lille, specializing in Application Development (design, development, and validation) at the Villeneuve-d’Ascq IUT campus.<br><br>🏙️ Student life in Lille:<br>Since starting my studies, I have been living in Lille, specifically in Hellemmes, allowing me to live independently while staying close to my university.",
  "apropos-langues": "Languages",
  "apropos-soft": "Soft Skills",
  "apropos-passions": "Hobbies",
  "apropos-changer": "Click a flag to change the website's language.",
  "skill-team-text": "<i class=\"fas fa-users\" style=\"margin-right: 5px;\"></i>Teamwork:",
  "skill-team": "Experienced in collaborative projects, I use agile methodologies like Scrum for effective task allocation and coordination.",
  "skill-adapt-text": "<i class=\"fas fa-sync-alt\" style=\"margin-right: 5px;\"></i>Adaptability:",
  "skill-adapt": "My diverse experiences in programming and seasonal jobs have taught me to quickly adapt to changing needs and environments.",
  "skill-comm-text": "<i class=\"fas fa-comments\" style=\"margin-right: 5px;\"></i>Communication:",
  "skill-comm": "As a web developer and versatile employee, I can clearly communicate information and understand the needs of clients and teams.",
  "skill-analytical-text": "<i class=\"fas fa-chart-line\" style=\"margin-right: 5px;\"></i>Analytical Thinking:",
  "skill-analytical": "My technical projects have taught me to analyze requirements and solve complex problems effectively.",
  "passion-sport-text": "<i class=\"fas fa-running\" style=\"margin-right: 5px;\"></i>Weightlifting and skiing:",
  "passion-sport": "Weightlifting and skiing instill discipline and perseverance, pushing me to overcome new physical challenges constantly.",
  "passion-culture-text": "<i class=\"fas fa-globe\" style=\"margin-right: 5px;\"></i>Cultural exploration:",
  "passion-culture": "I am passionate about discovering new cultures, which helps me adapt and interact with people from diverse backgrounds.",
  "passion-games-text": "<i class=\"fas fa-gamepad\" style=\"margin-right: 5px;\"></i>Video games and game development:",
  "passion-games": "I enjoy video games as both a player and a developer. Creating projects like Minecraft mods lets me combine creativity and technical skills.",
  "comp-title": "Skills",
  "comp-programming": "Programming",
  "comp-object-languages": "Object-Oriented Languages",
  "comp-java": "Java",
  "comp-sql": "SQL",
  "comp-javascript": "JavaScript",
  "comp-c": "C",
  "comp-it": "IT",
  "comp-git": "Git Management",
  "comp-figma": "Figma",
  "comp-scrum": "Scrum Methodology",
  "comp-nodejs": "Node.js",
  "comp-linux": "Linux",
  "comp-web-dev": "Web Development",
  "comp-html": "HTML",
  "comp-css": "CSS",
  "comp-jquery": "jQuery",
  "comp-wordpress": "WordPress",
  "comp-other": "Other",
  "comp-communication": "Communication",
  "comp-marketing": "Marketing",
  "comp-teamwork": "Teamwork",
  "projects-title": "Projects",
  "project-spaceclicker": "Space Clicker",
  "project-study": "Study Project",
  "project-parcoursup": "Parcoursup",
  "project-classifier": "Application-Classificator",
  "project-server": "Online Game Server",
  "project-personal": "Personal Project",
  "project-chess": "Web Chess Game",
  "project-portfolio": "Portfolio",
  "project-personal-study": "Personal/Study Project",
  "project-ecovoit": "EcoVoit",
  "project-planetgame": "PlanetGame",
  "project-sncf": "SNCF Application",
  "project-lineconf": "LineConf",
  "project-spaceclicker-title": "Space Clicker - BUT2 - 2024",
  "project-spaceclicker-description": "This project, called SpaceClicker, involved developing a clicker game in Java, where the player explores space, accumulates points, and upgrades their equipment to progress. The goal was to complete the application in a team of five using Scrum methodology over a period of three days. We structured development into multiple sprints, allowing us to move quickly and iterate on key features.",
  "project-spaceclicker-contribution": "In this project, I contributed to designing the save system and implementing user interactions. As a team, we divided tasks to efficiently integrate each feature and ensure smooth gameplay.",
  "project-spaceclicker-grade": "Grade obtained for this project: 16/20",
  "project-parcoursup-title": "Parcoursup - BUT1 - 2024",
  "project-parcoursup-description": "This project involved using raw data from Parcoursup 2023 and creating a relational database using PostgreSQL. The main goal was to model this data, structure it into tables, and make SQL queries to extract relevant information.",
  "project-parcoursup-contribution": "In this project, I mainly worked on data modeling by creating an ERD and structuring the data into tables to avoid redundancy. I also wrote SQL queries to segment and analyze the data, all while working in a team to write a report in HTML, converted to PDF.",
  "project-parcoursup-grade": "Grade obtained for this project: 19/20",
  "project-parcoursup-image": "Image of the Parcoursup project",
  "project-classifier-title": "Application Classification - BUT2 - 2024",
  "project-classifier-description": "This project involved developing an application that can load CSV data, visualize it in scatter plots, and classify it using the k-NN algorithm. The user can select different attributes, adjust classification parameters, and check the model's accuracy.",
  "project-classifier-contribution": "In this project, I contributed to structuring the data and implementing the visualization interface in Java. We worked as a team, organizing tasks via GitLab for effective development.",
  "project-classifier-grade": "Grade obtained for this project: Pending.",
  "project-server-title": "Minecraft Game Server - 02/2022 | 10/2022",
  "project-server-description": "This project involved creating a custom Minecraft server with additional features to improve the players' experience. I developed several Java plugins to integrate new game mechanics like special events and customization options not present in the classic version. Additionally, I designed a website with an online store linked to the server, allowing players to buy items and ranks.",
  "project-server-promotion": "The server attracted around 5000 players, with an average of 40 players online daily. I also managed the server's promotion on social media to maintain an active audience. To ease management, I created a JavaScript bot that sent me notifications about the server's status on my phone, allowing me to react quickly to any issues, even without direct access to my PC.",
  "project-ecovoit-title": "EcoVoit - BUT1 - 2023",
  "project-ecovoit-description": "This project involved creating a carpooling website for Renault Electricity, aiming to promote ecology and cost-saving for employees. The site, called EcoVoit, allows users to offer and search for carpools. It was developed using only HTML and CSS, making it a simple presentation prototype with no advanced features.",
  "project-ecovoit-contribution": "In this project, I contributed to organizing and structuring the HTML and CSS code, using Flexbox for responsive layout. I also helped resolve style and layout issues as part of the team, ensuring the code was clear and well-structured for reviewers.",
  "project-ecovoit-grade": "Grade obtained for this project: 16/20",
  "project-portfolio-title": "Portfolio - BUT2 - 2024",
  "project-portfolio-description": "This project involved designing and developing my portfolio, giorgio-dev.com, to showcase my skills, projects, and professional background. The goal was to create a modern and intuitive showcase reflecting my passion for development and design.",
  "project-portfolio-contribution": "In this project, I used HTML, CSS, and JavaScript for smooth and responsive navigation. I also ensured the information was structured clearly to provide an optimal user experience.",
  "project-portfolio-grade": "Grade obtained for this project: Pending.",
  "project-sncf-title": "SNCF Application - BUT1 - 2024",
  "project-sncf-description": "This project involved developing a travel assistant app that calculates, visualizes, and compares multimodal routes between cities, considering factors like cost, time, and CO2 emissions to propose the best routes.",
  "project-sncf-contribution": "In this project, I primarily worked on Java programming, graph modeling, and using JavaFX to design the user interface. I also participated in optimizing algorithms and implementing features to calculate and compare routes. We worked as a team to develop the application, distributing the more complex tasks.",
  "project-sncf-grade": "Grade obtained for this project: 15/20",
  "project-echec-title": "Chess Game - Senior Year - 2023",
  "project-echec-description": "This project is an online chess game developed for a computer science project in senior year with the NSI specialty. The game allows two players to face each other on the same screen. The goal was to create a simple, fluid interface with the possibility of adding multiplayer mode in the future.",
  "project-echec-contribution": "In this project, I primarily worked on developing the interface in HTML, CSS, and JavaScript using the jQuery library. Much of my work involved designing the site and creating an intuitive interface for users. I also faced several technical challenges, particularly with managing interactions between pieces and the interface, which I resolved through testing and successive adjustments.",
  "project-planetgame-title": "PlanetGame - BUT1 - 2023",
  "project-planetgame-description": "This project is an educational game in three levels to teach the solar system. The student starts with a memory game to match planet positions. In the next level, they must place each planet in the correct order around the sun with three attempts. The final level is a quiz on the planets. The student wins if they complete all three levels.",
  "project-planetgame-contribution": "In this project, I primarily worked on developing the game, using Visual Studio Code and GitLab for code management. I also had to dive into the ijavac documentation to implement complex features like saving user progress and managing the database for storing scores and answers. I performed numerous tests to ensure each feature worked, gradually adjusting the code to improve gameplay.",
  "project-planetgame-grade": "Grade obtained for this project: 20/20",
  "project-lineconf-title": "LineConf - 01/2022",
  "project-lineconf-description": "This project involved organizing an event called LineConf, where developers gather in teams of three to create an application around a given theme using the programming language of their choice. The event lasts 15 days, and at the end, a contest is held to choose and reward the best project among the participants.",
  "project-lineconf-contribution": "For this event, I developed a static website that allowed participants to register, get information about the contest, and discover the theme. The site also allowed participants to submit their completed projects, making the contest organization easier.",
  "formations-title": "Education",
  "formation-but-title": "Bachelor's in Computer Science",
  "formation-but-dates": "09/2023 - Present",
  "formation-but-description": "Application development track: design, development, validation. At the University of Lille, Villeneuve d'Ascq.",
  "formation-bac-title": "High School Diploma",
  "formation-bac-dates": "09/2020 - 07/2023",
  "formation-bac-description": "Specializations in Mathematics, Physics, and Computer Science. At Arthur Rimbaud High School, Sin-Le-Noble.",
  "experiences-title": "Experiences",
  "experience-date-06-2024": "06/2024",
  "experience-job-06-2024": "Maintenance Agent",
  "experience-location-06-2024": "Piscine des Glacis - Douai",
  "experience-description-06-2024": "Maintenance (cleaning cabins and restrooms) and customer service in a seasonal student job at age 18.",
  "experience-date-07-2024": "07/2024 - 09/2024",
  "experience-job-07-2024": "General Employee",
  "experience-location-07-2024": "APE Du Douaisis - Douai",
  "experience-description-07-2024": "General employee (communication, computer work, member management) in a seasonal job at age 18.",
  "experience-date-2023": "2023",
  "experience-job-2023": "Web Developer",
  "experience-location-2023": "APE Du Douaisis - Douai",
  "experience-description-2023": "Redesigned the APE Du Douaisis website, improving access for members at age 17.",
  "experience-date-06-2023": "06/2023 - 09/2023",
  "experience-job-06-2023": "General Employee",
  "experience-location-06-2023": "APE Du Douaisis - Douai",
  "experience-description-06-2023": "General employee (communication, computer work, member management) in a seasonal job at age 17.",
  "experience-date-06-2022": "06/2022 - 09/2022",
  "experience-job-06-2022": "General Employee",
  "experience-location-06-2022": "APE Du Douaisis - Douai",
  "experience-description-06-2022": "General employee (communication, computer work, member management) in a seasonal job at age 16.",
  "contact-title": "Contact",
  "contact-label-name": "Name",
  "contact-label-email": "Email",
  "contact-label-message": "Message",
  "contact-submit-button": "Send",
  "contact-confirm-submit": "I have received your message, it has been sent successfully! I will get back to you as soon as possible.",
  "footer-home": "Home",
  "footer-about": "About",
  "footer-skills": "Skills",
  "footer-projects": "Projects",
  "footer-education": "Education",
  "footer-experience": "Experiences",
  "footer-contact": "Contact",
  "footer-location-hellemmes": "Hellemmes",
  "footer-location-sinle": "Sin-Le-Noble",
  "footer-email": "gioutzeri@gmail.com",
  "footer-social-media": "My Social Networks"
}