{
  "propos": "Informazioni",
  "comp": "Competenze",
  "proj": "Progetti",
  "form": "Formazione",
  "exp": "Esperienze",
  "cont": "Contatti",
  "hero-title": "Portfolio",
  "hero-name": "Giorgio UTZERI",
  "hero-description": "Studente in Informatica (BUT)",
  "apropos-h1": "Informazioni",
  "apropos-p": "🙍‍♂️ Presentazione :<br>Mi chiamo Giorgio Utzeri, ho 19 anni, e sono appassionato di programmazione. Mi dedico a diversi linguaggi e metodi di lavoro per migliorarmi ogni giorno.<br><br>📖 Studi :<br>Attualmente sono al secondo anno di un BUT in Informatica presso l'Università di Lille, percorso A (realizzazione di applicazioni: progettazione, sviluppo e validazione), al campus IUT di Villeneuve-d’Ascq.<br><br>🏙️ Vita studentesca a Lille :<br>Fin dall'inizio del mio percorso nel BUT, vivo a Lille, precisamente a Hellemmes. Questo mi permette di vivere in modo indipendente e di essere vicino al mio IUT.",
  "apropos-langues": "Lingue",
  "apropos-soft": "Soft Skills",
  "apropos-passions": "Passioni",
  "apropos-changer": "Clicca su una bandiera per cambiare la lingua del sito.",
  "skill-team-text": "<i class=\"fas fa-users\" style=\"margin-right: 5px;\"></i>Lavoro di squadra:",
  "skill-team": "Abituato a lavorare in gruppo su progetti collaborativi, utilizzo metodologie agili come Scrum per una buona coordinazione e distribuzione dei compiti.",
  "skill-adapt-text": "<i class=\"fas fa-sync-alt\" style=\"margin-right: 5px;\"></i>Adattabilità:",
  "skill-adapt": "Le mie esperienze variegate in programmazione e lavori stagionali mi hanno insegnato ad adattarmi rapidamente alle esigenze e ai contesti mutevoli.",
  "skill-comm-text": "<i class=\"fas fa-comments\" style=\"margin-right: 5px;\"></i>Comunicazione:",
  "skill-comm": "Come sviluppatore web e impiegato polivalente, so trasmettere informazioni chiaramente e comprendere i bisogni di clienti e team.",
  "skill-analytical-text": "<i class=\"fas fa-chart-line\" style=\"margin-right: 5px;\"></i>Mentalità analitica:",
  "skill-analytical": "I miei progetti tecnici mi hanno insegnato ad analizzare i bisogni e risolvere i problemi in modo efficace, anche per compiti complessi.",
  "passion-sport-text": "<i class=\"fas fa-running\" style=\"margin-right: 5px;\"></i>Bodybuilding e sci:",
  "passion-sport": "Il bodybuilding e lo sci mi danno disciplina e perseveranza, spingendomi costantemente a superare nuove sfide fisiche.",
  "passion-culture-text": "<i class=\"fas fa-globe\" style=\"margin-right: 5px;\"></i>Esplorazione culturale:",
  "passion-culture": "Appassionato di esplorazione, amo scoprire nuove culture, il che mi aiuta ad adattarmi e a interagire con persone di orizzonti diversi.",
  "passion-games-text": "<i class=\"fas fa-gamepad\" style=\"margin-right: 5px;\"></i>Videogiochi e sviluppo di giochi:",
  "passion-games": "I videogiochi mi interessano sia come giocatore che come sviluppatore. Progettare progetti su giochi come Minecraft mi permette di combinare creatività e tecnica.",
  "comp-title": "Competenze",
  "comp-programming": "Programmazione",
  "comp-object-languages": "Linguaggi a Oggetti",
  "comp-java": "Java",
  "comp-sql": "SQL",
  "comp-javascript": "JavaScript",
  "comp-c": "C",
  "comp-it": "Informatica",
  "comp-git": "Gestione Git",
  "comp-figma": "Figma",
  "comp-scrum": "Metodo Scrum",
  "comp-nodejs": "NodeJs",
  "comp-linux": "Linux",
  "comp-web-dev": "Sviluppo Web",
  "comp-html": "HTML",
  "comp-css": "CSS",
  "comp-jquery": "jQuery",
  "comp-wordpress": "WordPress",
  "comp-other": "Altro",
  "comp-communication": "Comunicazione",
  "comp-marketing": "Marketing",
  "comp-teamwork": "Lavoro di Squadra",
  "projects-title": "Progetti",
  "project-spaceclicker": "Space Clicker",
  "project-study": "Progetto di Studio",
  "project-parcoursup": "Parcoursup",
  "project-classifier": "Applicazione-Classificazione",
  "project-server": "Server di gioco online",
  "project-personal": "Progetto Personale",
  "project-chess": "Gioco di scacchi WEB",
  "project-portfolio": "Portfolio",
  "project-personal-study": "Progetto Personale / Progetto di Studio",
  "project-ecovoit": "EcoVoit",
  "project-planetgame": "PlanetGame",
  "project-sncf": "Applicazione SNCF",
  "project-lineconf": "LineConf",
  "project-spaceclicker-title": "Space Clicker - BUT2 - 2024",
  "project-spaceclicker-description": "Questo progetto, chiamato SpaceClicker, consisteva nello sviluppare un gioco clicker in Java, dove il giocatore esplora lo spazio, accumula punti e migliora l'equipaggiamento per progredire. L'obiettivo era realizzare questa applicazione in un team di cinque persone utilizzando il metodo Scrum in un periodo di tre giorni. Abbiamo strutturato lo sviluppo in diversi sprint, permettendoci di avanzare rapidamente e iterare sulle funzionalità principali.",
  "project-spaceclicker-contribution": "In questo progetto, ho contribuito alla progettazione del sistema di salvataggio e all'implementazione delle interazioni utente. In squadra, abbiamo condiviso i compiti per integrare efficacemente ogni funzionalità e garantire la fluidità dell'esperienza di gioco.",
  "project-spaceclicker-grade": "Voto ottenuto per questo progetto: 16/20",
  "project-parcoursup-title": "Parcoursup - BUT1 - 2024",
  "project-parcoursup-description": "Questo progetto consisteva nell'elaborare un file di dati grezzi provenienti da Parcoursup 2023 e creare un database relazionale utilizzando PostgreSQL. L'obiettivo principale era modellare questi dati, strutturarli in tabelle e creare query SQL per estrarre informazioni rilevanti.",
  "project-parcoursup-contribution": "In questo progetto, ho lavorato principalmente alla modellazione dei dati creando un MCD e strutturando i dati in tabelle per evitare ridondanze. Ho anche scritto query SQL per analizzare i dati, tutto questo in team per poi redigere un rapporto in HTML convertito in PDF.",
  "project-parcoursup-grade": "Voto ottenuto per questo progetto: 19/20",
  "project-parcoursup-image": "Immagine del progetto Parcoursup",
  "project-classifier-title": "Applicazione di Classificazione - BUT2 - 2024",
  "project-classifier-description": "Questo progetto consisteva nello sviluppare un'applicazione in grado di caricare dati CSV, visualizzarli come nuvole di punti e classificarli utilizzando l'algoritmo k-NN. L'utente può scegliere diversi attributi, regolare i parametri di classificazione e la precisione del modello.",
  "project-classifier-contribution": "In questo progetto, ho contribuito alla strutturazione dei dati e alla realizzazione dell'interfaccia di visualizzazione in Java. Abbiamo lavorato in squadra, organizzando i compiti tramite GitLab per garantire un buon sviluppo.",
  "project-classifier-grade": "Voto ottenuto per questo progetto: in attesa.",
  "project-server-title": "Server di gioco Minecraft - 02/2022 | 10/2022",
  "project-server-description": "Questo progetto consisteva nella creazione di un server Minecraft personalizzato, con funzionalità aggiuntive per migliorare l'esperienza di gioco. Ho sviluppato diversi plugin in Java per integrare nuove meccaniche, come eventi speciali e opzioni di personalizzazione non presenti nella versione classica. Parallelamente, ho creato un sito web con uno shop online collegato al server, che permetteva ai giocatori di acquistare oggetti e ruoli.",
  "project-server-promotion": "Il server ha attirato circa 5000 giocatori, con una media di 40 giocatori connessi quotidianamente. Ho anche gestito la promozione sui social media per mantenere un pubblico attivo. Per facilitare la gestione, ho creato un bot in JavaScript che inviava notifiche con le informazioni del server sul mio telefono, permettendomi di reagire rapidamente ai problemi anche senza accesso diretto al PC.",
  "project-ecovoit-title": "EcoVoit - BUT1 - 2023",
  "project-ecovoit-description": "Questo progetto consisteva nel creare un sito web di carpooling per l'azienda Renault Electricity, per incoraggiare l'ecologia e il risparmio tra i dipendenti. Il sito, chiamato EcoVoit, consente agli utenti di proporre e cercare carpooling. Realizzato esclusivamente in HTML e CSS, è un semplice prototipo dimostrativo, senza funzionalità avanzate.",
  "project-ecovoit-contribution": "In questo progetto, ho contribuito all'organizzazione e alla struttura del codice HTML e CSS, utilizzando Flexbox per un layout responsive. Ho anche risolto problemi di stile e layout in squadra, assicurandomi che il codice fosse chiaro e ben strutturato per gli esaminatori.",
  "project-ecovoit-grade": "Voto ottenuto per questo progetto: 16/20",
  "project-portfolio-title": "Portfolio - BUT2 - 2024",
  "project-portfolio-description": "Questo progetto consisteva nel progettare e sviluppare il mio portfolio, giorgio-dev.com, per presentare le mie competenze, i miei progetti e il mio percorso professionale. L'obiettivo era creare una vetrina moderna e intuitiva, che riflettesse la mia passione per lo sviluppo e il design.",
  "project-portfolio-contribution": "In questo progetto, ho utilizzato HTML, CSS e JavaScript per una navigazione fluida e responsive. Ho anche organizzato le informazioni in modo chiaro per offrire un'esperienza utente ottimale.",
  "project-portfolio-grade": "Voto ottenuto per questo progetto: in attesa.",
  "project-sncf-title": "Applicazione SNCF - BUT1 - 2024",
  "project-sncf-description": "Questo progetto consisteva nello sviluppare un'applicazione di assistente di viaggio per calcolare, visualizzare e confrontare percorsi multimodali tra diverse città, tenendo conto di criteri come costo, tempo ed emissioni di CO2 per proporre i migliori itinerari.",
  "project-sncf-contribution": "In questo progetto, ho lavorato principalmente sulla programmazione Java, sulla modellazione di grafi e sull'uso di JavaFX per progettare l'interfaccia utente. Ho partecipato anche all'ottimizzazione degli algoritmi e alla realizzazione delle funzionalità per calcolare e confrontare gli itinerari. Abbiamo lavorato in team per completare l'applicazione, suddividendo i compiti più complessi.",
  "project-sncf-grade": "Voto ottenuto per questo progetto: 15/20",
  "project-echec-title": "Gioco di scacchi - Liceo - 2023",
  "project-echec-description": "Questo progetto è un gioco di scacchi online sviluppato per un progetto informatico al liceo con la specialità NSI. Il gioco permette a due giocatori di sfidarsi sullo stesso schermo. L'obiettivo era creare un'interfaccia semplice e fluida, con la possibilità di aggiungere una modalità multiplayer in futuro.",
  "project-echec-contribution": "In questo progetto, ho lavorato principalmente sullo sviluppo dell'interfaccia in HTML, CSS e JavaScript con la libreria jQuery. Gran parte del mio lavoro è consistito nel progettare il design del sito e creare un'interfaccia intuitiva per gli utenti. Ho anche risolto diverse sfide tecniche, come la gestione delle interazioni tra i pezzi e l'interfaccia, che ho affrontato con test e regolazioni successive.",
  "project-planetgame-title": "PlanetGame - BUT1 - 2023",
  "project-planetgame-description": "Questo progetto è un gioco educativo in tre livelli per apprendere il sistema solare. Lo studente inizia con un memory game per associare le posizioni dei pianeti. Nel livello successivo, deve posizionare ogni pianeta attorno al sole nell'ordine corretto con tre tentativi. L'ultimo livello è un quiz finale sui pianeti. Lo studente vince se supera tutti e tre i livelli.",
  "project-planetgame-contribution": "In questo progetto, ho lavorato principalmente sullo sviluppo del gioco, utilizzando Visual Studio Code e GitLab per la gestione del codice. Ho anche consultato la documentazione di iJavaC per implementare funzionalità complesse, come il sistema di salvataggio dei progressi dell'utente e la gestione di un database per memorizzare i punteggi e le risposte. Ho eseguito numerosi test per garantire il corretto funzionamento di ogni funzionalità, migliorando progressivamente il codice per ottimizzare l'esperienza di gioco.",
  "project-planetgame-grade": "Voto ottenuto per questo progetto: 20/20",
  "project-lineconf-title": "LineConf - 01/2022",
  "project-lineconf-description": "Questo progetto consisteva nell'organizzare un evento chiamato LineConf, dove sviluppatori si riuniscono in team di tre per creare un'applicazione su un tema dato, utilizzando il linguaggio di programmazione a scelta. L'evento dura 15 giorni, e alla fine viene organizzato un concorso per eleggere e premiare il miglior progetto tra i partecipanti.",
  "project-lineconf-contribution": "Per questo evento, ho sviluppato un sito web statico che permetteva ai partecipanti di registrarsi, ottenere tutte le informazioni sul concorso e scoprire il tema. Il sito offriva anche la possibilità di inviare i progetti una volta completati, facilitando l'organizzazione del concorso.",
  "formations-title": "Formazione",
  "formation-but-title": "Laurea Tecnologica in Informatica (BUT)",
  "formation-but-dates": "09/2023 - Presente",
  "formation-but-description": "Percorso realizzazione di applicazioni: progettazione, sviluppo, validazione. Presso l'Università di Lille, Villeneuve d’Ascq.",
  "formation-bac-title": "Diploma di maturità",
  "formation-bac-dates": "09/2020 | 07/2023",
  "formation-bac-description": "Specializzazioni in Matematica, Fisica e Informatica (NSI). Presso il liceo Arthur Rimbaud di Sin-Le-Noble.",
  "experiences-title": "Esperienze",
  "experience-date-06-2024": "06/2024",
  "experience-job-06-2024": "Addetto alle pulizie",
  "experience-location-06-2024": "Piscina des Glacis - Douai",
  "experience-description-06-2024": "Addetto alle pulizie (cabine e bagni) e accoglienza clienti, durante un impiego stagionale studentesco all'età di 18 anni.",
  "experience-date-07-2024": "07/2024 | 09/2024",
  "experience-job-07-2024": "Impiegato polivalente",
  "experience-location-07-2024": "APE Du Douaisis - Douai",
  "experience-description-07-2024": "Impiegato polivalente (comunicazione, lavoro informatico, gestione delle attribuzioni e degli associati) durante un impiego stagionale all'età di 18 anni.",
  "experience-date-2023": "Anno 2023",
  "experience-job-2023": "Sviluppatore Web",
  "experience-location-2023": "APE Du Douaisis - Douai",
  "experience-description-2023": "Ho progettato il restyling del sito internet dell'APE Du Douaisis, migliorando l'accessibilità per gli associati, all'età di 17 anni.",
  "experience-date-06-2023": "06/2023 | 09/2023",
  "experience-job-06-2023": "Impiegato polivalente",
  "experience-location-06-2023": "APE Du Douaisis - Douai",
  "experience-description-06-2023": "Impiegato polivalente (comunicazione, lavoro informatico, gestione delle attribuzioni e degli associati) durante un impiego stagionale all'età di 17 anni.",
  "experience-date-06-2022": "06/2022 | 09/2022",
  "experience-job-06-2022": "Impiegato polivalente",
  "experience-location-06-2022": "APE Du Douaisis - Douai",
  "experience-description-06-2022": "Impiegato polivalente (comunicazione, lavoro informatico, gestione delle attribuzioni e degli associati) durante un impiego stagionale all'età di 16 anni.",
  "contact-title": "Contatti",
  "contact-label-name": "Nome",
  "contact-label-email": "E-mail",
  "contact-label-message": "Messaggio",
  "contact-submit-button": "Invia",
  "contact-confirm-submit": "Ho ricevuto il tuo messaggio, è stato inviato con successo! Ti ricontatterò il prima possibile.",
  "footer-home": "Home",
  "footer-about": "Chi sono",
  "footer-skills": "Competenze",
  "footer-projects": "Progetti",
  "footer-education": "Formazione",
  "footer-experience": "Esperienze",
  "footer-contact": "Contatti",
  "footer-location-hellemmes": "Hellemmes",
  "footer-location-sinle": "Sin-Le-Noble",
  "footer-email": "gioutzeri@gmail.com",
  "footer-social-media": "I miei social"
}